// Присвоєння за посиланням та за значенням

// За значенням
/*
let a = 5;
// Присвоєння за значенням, у пам'яті буде створено ще
// одна комірка, в яку буде скопійовано значення 5
let b = a;
console.log(a); // 5
console.log(b); // 5

// Змінимо значення a
a = 10;
console.log(a); // 10
// Значення b не змінилося, оскільки це окрема копія
console.log(b); // 5
*/

// За посиланням

const a = ["Mango"];
// Так як a це масив, b записується посилання на вже існуючий
// масив у пам'яті. Тепер a і b вказують на той самий масив.
const b = a;
console.log(a); // ["Mango"]
console.log(b); // ["Mango"]

// Змінимо масив, додавши ще один елемент, використовуючи покажчик з a
a.push("Poly");
console.log(a); // ["Mango", "Poly"]

// b також змінилося, тому що b, як і a,
// просто містить посилання одне і те місце у пам'яті
console.log(b); // ["Mango", "Poly"]

//Результат повторюється
b.push("Ajax");
console.log(a); // ["Mango", "Poly", "Ajax"]
console.log(b); // ["Mango", "Poly", "Ajax"]